n=174457
N=174505
k=174458
l=[]
L=[]
i=0
I=0
a=0
#шаг между числами не более 48, макс общ делитель 23
while n<N+1:
    if n%2==0:
        l+=2
    if n % 3 == 0:
        l+=3
    if n % 5 == 0:
        l+=5
    if n % 7 == 0:
        l+=7
    if n % 11 == 0:
        l+=11
    if n % 13 == 0:
        l+=13
    if n % 17 == 0:
        l+=17
    if n % 19 == 0:
        l+=19
    if n % 23 == 0:
        l+=23
    while k<N+1:
        if k % 2 == 0:
            L+=[2]
        if k % 3 == 0:
            L+=[3]
        if k % 5 == 0:
            L+=[5]
        if k % 7 == 0:
            L+=[7]
        if k % 11 == 0:
            L+=[11]
        if k % 13 == 0:
            L+=[13]
        if k %17== 0:
            L+=[17]
        if k%19== 0:
            L+=[19]
        if k % 23 == 0:
            L+=[23]
        while i<len(l):
            while I<len(L):
                if l[i]==L[I]:
                    a+=1
                I+=1
            i+=1
            I=0
        if len(l)-a==2:
            print (n)
        a=0
        i=0
        L=[]
        k+=1
    n=+1
    k-=46
    l=[]